{
  "titles": {
    "about": "FullstacksJS - Community",
    "rules": "FullstackJS - Rules",
    "events": "FullstacksJS - Events"
  },
  "header": {
    "vision": "باهم رشد می‌کنیم",
    "button": "به ما بپیوندید"
  },
  "navigation": {
    "about": "درباره ما",
    "ask": "پرسیدن",
    "rules": "قوانین",
    "events": "رویدادها"
  },
  "main": {
    "about": {
      "title": "درباره جامعه",
      "content": "<0>FullstacksJS</0> یک جامعه در حوزه‌ی برنامه‌نویسی و مهندسی نرم‌افزار با هدف یادگیری هستیم. هدف اصلی این جامعه ایجاد بستری حرفه‌ای برای یادگیری عمیق مفاهیم در حوزه توسعه و مهندسی نرم‌افزار است. از سری برنامه‌های ما در این جامعه پرسش و پاسخ توسط منتورها، برگزاری میت‌آپ‌ها، لایوها و تولید دوره‌های آموزشی است. همچنین در راستای یادگیری و تقویت فرهنگِ توسعه و مشارکت متن‌ باز،‌ پروژه‌هایی که در این جامعه توسعه داده می‌شود، کاملا متن باز بوده و اعضا می‌توانند در آن‌ها مشارکت داشته باشند."
    },
    "motivation": {
      "title": "اهداف و انگیزه شکل‌گیری",
      "content": "محیط اینترنت از محتوا، آموزش‌ها و انجمن‌های برنامه‌نویسی نظارت نشده‌ای اشباع شده است. این انجمن‌ها با هدف کسب شهرت یا برندسازی شخصی، اطلاعات <0>ناقص</0>، <1>منسوخ</1> شده و گاها <2>اشتباهی</2> را به جویندگان دانش این حوزه منتقل می‌کنند. از این رو، تصمیم گرفتیم تا بستری ایجاد نماییم که محتوا و فعالیت‌های آن توسط افراد متخصص مدیریت و نظارت شود."
    },
    "values": {
      "title": "ارزش‌های ما",
      "content": "ارزش‌ها به جامعه ما شکل می‌دهند و مشخص کننده مسیر حرکت و تصمیمات جامعه می‌باشند. تصمیم‌ها و فرم محتوای تولید شده در جامعه به صورت مستقیم از این ارزش‌ها تاثیر می‌پذیرند.",
      "ethics": "<0>اخلاق:</0> مهم‌ترن ارزش در جامعه که بالاترین الویت را در تصمیمات دارا می‌باشد. در جامعه هیچگاه ارزش‌های اخلاقی بخاطر منافع حاصل از فعالیت‌ها کنار گذاشته نمی‌شوند.",
      "validity": "<0>صحت اطلاعات و محتوای تولید شده:</0> محتوایی که در جامعه تولید یا توسط جامعه تایید و بازنشر داده می‌شوند، باید توسط افراد متخصص اعتبارسنجی شده باشند. اگر پس از نشر محتوا متوجه اشتباه بودن مطالب شویم باید اشتباه بودن آن را اطلاع رسانی کرده و محتوای تصحیح کند."
    }
  },
  "social": {
    "telegram": "تلگرام",
    "youtube": "یوتیوب",
    "twitter": "توئیتر",
    "github": "گیت‌هاب",
    "discord": "دیسکورد",
    "twitch": "توئیتچ"
  },
  "rules": {
    "title": "قوانین جامعه",
    "desc": "رفتارهای زیر در جامعه ما <0>آزار و اذیت</0> در نظر گرفته می‌شود و <1>غیرقابل قبول</1> است:",
    "items": {
      "violence": "خشونت، تهدید به خشونت یا زبان خشونت آمیز علیه فرد دیگر.",
      "nameCalling": "نام بردن یا صدا زدن شخص یا گروهی از افراد با القاب توهین آمیز.",
      "nsfw": "ارسال محتوای <0>NSFW</0>.",
      "personal": "ارسال اطلاعات شناسایی شخصی دیگران.",
      "insult": "توهین یا نفرت‌پراکنی بر اساس <0>جنسیت</0>، <1>نژاد</1> <2>مذهب</2> و <3>ناتوانی</3>.",
      "sex": "توجه جنسی نامطلوب.",
      "copyright": "ارسال یا درخواست محتوای مشمول حق چاپ.",
      "spam": "هرزنامه.",
      "dm": "<0>پیام دادن</0>  به فردی بدون اجازه شخص.",
      "advocate": "حمایت یا تشویقِ هر یک از رفتارهای بالا."
    }
  },
  "ask": {
    "title": "چگونه سوال بپرسیم",
    "guides": {
      "precise": {
        "title": "جزئیات مشکل خودتون را به اشتراک بگذارید",
        "desc": "به جای اینکه فقط بگویید \\\"کد من کار نمی کند\\\" جزئیات خاصی در مورد مشکلی که با آن روبرو هستید را ارائه دهید. به عنوان مثال، زبان برنامه نویسی مورد استفاده، هرگونه پیام خطایی که دریافت کردید و اقداماتی که تاکنون برای حل مشکل انجام داده‌اید را ذکر کنید."
      },
      "environment": {
        "title": "اطلاعات محیط رو ضمیمه کنید",
        "desc": "اطلاعات سیستم‌عامل، Runtime یا برنامه‌ای را که استفاده می‌کنید، همراه با تنظیمات مرتبط ذکر کنید."
      },
      "diagnostic": {
        "title": "کارهایی که تا بحال برای حل مشکل انجام داده‌اید رو ذکر کنید",
        "desc": "اگر کار خاصی برای حل مشکل انجام داده‌اید مراحل و نتایج را ذکر کنید."
      },
      "sandbox": {
        "title": "با داشتن کد خیلی بهتر می‌شه مشکل را حل کرد",
        "desc": "اگر سوال شما مربوط به کدی است که نوشته اید، حتما آن کد را در پست خود قرار دهید. اما مراقب طول کد خود باشید و از ابزارهایی مانند codesandbox.com یا stackblitz.com برای به اشتراک گذاری کارآمدتر آن استفاده کنید."
      },
      "courteous": {
        "title": "مودب باشید",
        "desc": "به یاد داشته باشید که مردم وقت خود را برای کمک به شما اختصاص می‌دهند، بنابراین با آنها مودب و محترمانه رفتار کنید."
      },
      "topic": {
        "title": "Topic را با دقت انتخاب کنید",
        "desc": "مطمئن شوید که پست شما به در Topic مرتبط با آن پرسیده شده است. این کمک می‌کند تا سوال شما توسط افرادی که در مورد موضوع آگاه هستند دیده شود."
      },
      "xy": {
        "title": "هدف را توصیف کنید، نه راه حل",
        "desc": "به جای اینکه فقط بپرسید چگونه کاری را انجام دهید، هدف بزرگتری را که می‌خواهید به آن برسید را توصیف کنید. این می تواند به دیگران کمک کند تا توصیه های مفید و مرتبط تری ارائه دهند."
      },
      "rush": {
        "title": "عجله نکنید و ادعا کنید که یک Bug پیدا کرده‌اید",
        "desc": "حتی اگر کاملاً مطمئن هستید که یک باگ پیدا کرده‌اید، بهتر است به این موضوع برخورد کنید که گویی ممکن است اشتباهی انجام داده‌اید. این می‌تواند به شما کمک کند که برای پیشنهادات آماده باشید و زمان را برای تعقیب یک باگ ناموجود تلف نکنید."
      },
      "guess": {
        "title": "علائم مشکل را توصیف کنید، نه حدس های خود را",
        "desc": "از فرضیات یا حدس و گمان در مورد علت مشکل خودداری کنید. علائمی که تجربه می کنید را توصیف کندی و به دیگران اجازه دهید در تشخیص مشکل اصلی به شما کمک کنند."
      },
      "pv": {
        "title": "از مردم نخواهید که با PV پاسخ دهند",
        "desc": "گفتگو را عمومی نگه دارید تا دیگران بتوانند از بحث بهره ببرند و نظر خود را ارائه دهند."
      },
      "homework": {
        "title": "از ارسال تکلیف خود خودداری کنید",
        "desc": "در حالی که درخواست نکات یا راهنمایی اشکالی ندارد، از درخواست راه حل کامل برای تکالیف خودداری کنید. هدف تکلیف یادگیری است، بنابراین از فرصتی برای توسعه مهارت‌های خود به دست آمده استفاده کنید."
      }
    }
  },
  "guidelines": {
    "title": "دستورالعمل های جامعه",
    "items": {
      "kind": "مهربان و مؤدب، صمیمی و حرفه ای باشید. نیازی به بداخلاقی یا بی ادبی نیست.",
      "topic": "گفتگو را در سرفصل اشتباه شروع نکنید.",
      "cross": "یک مطلب را در چندین موضوع به صورت متقاطع ارسال نکنید.",
      "opinion": "احترام بگذاریم که مردم با هم اختلاف نظر داشته باشند."
    }
  },
  "upcomingEvents": {
    "title": "رویدادهای پیش رو",
    "action": "تهیه اشتراک",
    "actionCountModifier": "مشترک"
  },
  "archivedEvents": {
    "title": "رویدادهای بایگانی شده",
    "action": "تماشا ویدیو",
    "actionCountModifier": "مشترک"
  }
}
